Enums/ВидыЗначенийСветофора.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыЗначенийСветофора</Name>
			<Comment>Виды значений светофора</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеВыбрано</Name>
					<Comment>Не выбрано</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Норма</Name>
					<Comment>Норма</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Замечание</Name>
					<Comment>Замечание</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отказ</Name>
					<Comment>Отказ</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыЗначенийСветофора/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// преобразование к числовому значению
Функция ПреобразоватьКЧислу(Знач Значение) Экспорт
	
	Если Значение = Перечисления.ВидыЗначенийСветофора.Норма Тогда
		Возврат 1;
	ИначеЕсли Значение = Перечисления.ВидыЗначенийСветофора.Замечание Тогда
		Возврат 2;
	ИначеЕсли Значение = Перечисления.ВидыЗначенийСветофора.Отказ Тогда
		Возврат 3;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

// преобразование к перечислению
Функция ПреобразоватьКПеречислению(Знач Значение) Экспорт
	
	Если Значение = "1" Тогда
		Возврат Перечисления.ВидыЗначенийСветофора.Норма;
	ИначеЕсли Значение = "2" Тогда
		Возврат Перечисления.ВидыЗначенийСветофора.Замечание;
	ИначеЕсли Значение = "3" Тогда
		Возврат Перечисления.ВидыЗначенийСветофора.Отказ;
	Иначе
		Возврат Перечисления.ВидыЗначенийСветофора.НеВыбрано;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецЕсли
